In [4]:
import pandas as pd

#creating dataframe
data = {'company':['Facebook','Google','Microsoft','Apple'],
         'position': [11,12,13,14],
        'profit': [141,117,131,112]
       }
# setting dict kay as column
df = pd.DataFrame(data,columns=['company','position','profit'])
df

     company  position  profit
0   Facebook        11     141
1     Google        12     117
2  Microsoft        13     131
3      Apple        14     112

In [5]:
# create a function to convert all string into numbers
def str_to_num(v):
    if v == 'Facebook':
        return 4
    if v == 'Google':
        return 2
    if v== 'Microsoft':
        return 3
    if v == 'Apple':
        return 1

In [6]:
#apply function on data
df['company_num'] = df['company'].apply(str_to_num)
df

     company  position  profit  company_num
0   Facebook        11     141            4
1     Google        12     117            2
2  Microsoft        13     131            3
3      Apple        14     112            1